import React from 'react';

function Rules() {
  return (
    <>
      <h2>Правила</h2>
      <h3>История</h3>
      <p>
        На земле вот-вот произойдет катастрофа! Я, как и большинство людей в
        панике пытаюсь выжить, и найти укрытие, чтобы спасти свою жизнь. В
        поисках убежища я увидел группу людей, но не знал что делать... Стоит
        подойти к ним или нет? Но так как терять было нечего я решил пойти к
        ним... Как только я начал подходить к людям, я понял, что мне невероятно
        повезло — все эти люди находились возле бункера на который была
        последняя надежда! Как оказалось они ждут людей, которым все еще удалось
        выжить. Приняли меня хорошо, но что меня ждет дальше мне было не
        известно. Все что я понимал, так это то, что предстоит решить, кто
        действительно заслуживает попасть в бункер, чтобы остаться в живых. Тех,
        кто не попадет - ждет верная смерть. И тут началась моя история
        выживания...
      </p>
      <h3>Правила</h3>
      <p>Ваша задача убедить остальных, что вы достойны быть в бункере.</p>
      <h4>Первый круг</h4>
      <ol>
        <li>
          Каждый игрок по очереди открывает профессию и характеристику на выбор
          (количество открываемых характеристик в первом раунде может меняться в
          зависмости от количества игроков, согласуйте с другими игроками перед
          началом игры).
        </li>
        <li>
          После того как все рассказали, по кругу каждый начинает рассказывать
          свои мысли по поводу других игроков (кто должен остаться или кто уйти
          и тд.). Лучше не зятигивать этот процес и контролировать время, не
          более 1 мин на человека.
        </li>
        <li>Общее обсуждение 1 мин</li>
        <li>Голосование за того кого должны выгнать по очереди. </li>
        <li>
          После подсчета голосов, все у кого есть хоть 1 голос имеют 30 сек что
          бы переубедить других игроков.
        </li>
        <li>
          После оправдания игроков каждый может перенести свой голос в другого,
          но только 1 раз.
        </li>
        <li>Человек набравший найбольшое количество голосов - покидает игру</li>
      </ol>

      <h4>Остальные круги</h4>

      <p>
        Каждый новый круг вы открываете 1 характеристику по выбору. И делаете
        все что написано выше в пункте 2-7 и так пока не останеться половина от
        играющих.
      </p>

      <h4>Условия победы</h4>
      <p>
        Для победы нужно не только попасть в бункер, но и выполнить минимальные
        условия:
      </p>
      <ul>
        <li>
          Обеспечить потомство <span>(это главное условие).</span>
        </li>
        <li>Было кем и чем защищаться (в зависимости от условий игры)</li>
        <li>
          Выращивание еды после того как катастрофа пройдет (в зависимости от
          условий игры)
        </li>
        <li>
          Добычи воды после того как катастрофа пройдет (в зависимости от
          условий игры)
        </li>
        <li>и так далее...</li>
      </ul>

      <h5>
        Здесь все как в реальной жизни. Доктор - лечит болезни, психолог - дает
        возможнсть к деторождению (если не болезнь), курсы психологии могут
        вылечить 1го человека (он же все таки новичек) и тд. У вас всегда есть
        гугл если чего-то не знаете c(:
      </h5>

      <p>Приятной игры!!!!</p>
    </>
  );
}

export default Rules;
